x=c(1,2,6,8,9,10,11,12,14,16,17,18,20,22,23,24,25,27,29,30)
y=c(15,21,30,36,39,42,45,48,54,60,63,66,72,78,81,84,87,93,99,102)
#plot(x,y)

mdl=lm(x~y)
mdl


plot(y,x, col="red")
abline(a=-4.2385, b=0.3364, col="blaCK")
cor(x,y)
cor.test(x,y, method="spearman") #спостергіається дуже сильна лін залежність р=1 
cor.test(x,y, method="pearson")# (по замовч.)спостергіається дуже сильна лін залежність р=0,999
cor.test(x,y, method="kendall")#спостергіається дуже сильна лін залежність р=1

#Отримані т-значення, р-значення, всі свідчать, про наявність прямого лінійного зв'язку
#Гіпотеза про рівність коеф кореляції нулю - відхиляється, оскільки Р-значення майже 0